# ExportPDFSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPDFSettings Class
Members See Also
---
Settings for PDF export
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public class ExportPDFSettings : Element
```

Visual Basic
---
```text
Public Class ExportPDFSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class ExportPDFSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ExportPDFSettings
# See Also
ExportPDFSettings Members
Autodesk.Revit.DB Namespace